Revit 2027 API
BuiltInFailures.RebarFailures.ConstraintForHandleIsDisabled Property
 The constriant for current handle is disabled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConstraintForHandleIsDisabled { get; }
Public Shared ReadOnly Property ConstraintForHandleIsDisabled As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConstraintForHandleIsDisabled {
	FailureDefinitionId^ get ();
}
static member ConstraintForHandleIsDisabled : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace